Repository: denis-ershov/pllat-date-filter
Catalog: languages/pllat-date-filter-*.po
Languages: ru_ru

source: Date Filter Settings
ru_ru: Настройки фильтра дат

source: Date Filter
ru_ru: Фильтр дат

source: PLLAT Date Filter
ru_ru: PLLAT Фильтр дат

source: PLLAT Date Filter - Settings
ru_ru: PLLAT Фильтр дат — Настройки

source: Configure date filtering for posts processed by Polylang Automatic AI Translation plugin.
ru_ru: Настройте фильтрацию по дате для записей, обрабатываемых плагином Polylang Automatic AI Translation.

source: Enable Filtering
ru_ru: Включить фильтрацию

source: Enable date filtering for posts
ru_ru: Включить фильтрацию записей по дате

source: Filter Type
ru_ru: Тип фильтра

source: From specific date
ru_ru: С определённой даты

source: Date range
ru_ru: Диапазон дат

source: Choose filter type: from specific date or within date range
ru_ru: Выберите тип фильтра: с определённой даты или в диапазоне дат

source: Start Date
ru_ru: Начальная дата

source: Start date for filtering (inclusive)
ru_ru: Начальная дата для фильтрации (включительно)

source: End Date
ru_ru: Конечная дата

source: End date for filtering (inclusive). Used only with "Date range" option
ru_ru: Конечная дата для фильтрации (включительно). Используется только с опцией «Диапазон дат»

source: Date Order
ru_ru: Порядок по дате

source: Ascending (oldest first)
ru_ru: По возрастанию (сначала старые)

source: Descending (newest first)
ru_ru: По убыванию (сначала новые)

source: Order of posts by publication date
ru_ru: Порядок записей по дате публикации

source: Post Status
ru_ru: Статус записей

source: Published
ru_ru: Опубликовано

source: Draft
ru_ru: Черновик

source: Pending Review
ru_ru: Ожидает проверки

source: Private
ru_ru: Личная

source: Scheduled
ru_ru: Запланирована

source: Trash
ru_ru: Корзина

source: Select which post statuses to include in filtering. At least one status must be selected.
ru_ru: Выберите статусы записей для фильтрации. Должен быть выбран хотя бы один статус.

source: Settings saved
ru_ru: Настройки сохранены

source: Filter Settings
ru_ru: Настройки фильтра

source: Save Settings
ru_ru: Сохранить настройки

source: Information
ru_ru: Информация

source: How it works:
ru_ru: Как это работает:

source: Plugin filters posts when Polylang Automatic AI Translation runs
ru_ru: Плагин фильтрует записи при запуске Polylang Automatic AI Translation

source: "From specific date" - processes posts published on or after specified date
ru_ru: «С определённой даты» — обрабатывает записи, опубликованные в указанную дату или позже

source: "Date range" - processes posts published between two specific dates
ru_ru: «Диапазон дат» — обрабатывает записи, опубликованные между двумя указанными датами

source: Date order controls the sequence of post processing
ru_ru: Порядок по дате определяет последовательность обработки записей

source: Post status filter allows targeting specific post types by their publication status
ru_ru: Фильтр статуса позволяет выбирать записи по статусу публикации

source: Filtering is applied automatically when enabled
ru_ru: Фильтрация применяется автоматически при включении

source: Current settings:
ru_ru: Текущие настройки:

source: Status:
ru_ru: Статус:

source: Enabled
ru_ru: Включено

source: Disabled
ru_ru: Отключено

source: Type:
ru_ru: Тип:

source: Start date:
ru_ru: Начальная дата:

source: End date:
ru_ru: Конечная дата:

source: Testing
ru_ru: Тестирование

source: To check if filter is working, look at WordPress error log. When filter is applied, you will see entries like:
ru_ru: Чтобы проверить работу фильтра, смотрите лог ошибок WordPress. При применении фильтра появятся записи вида:

source: Settings location:
ru_ru: Расположение настроек:

source: Settings are located in %s menu
ru_ru: Настройки находятся в меню %s

source: Languages → Date Filter
ru_ru: Языки → Фильтр дат

source: Settings → PLLAT Date Filter
ru_ru: Настройки → PLLAT Фильтр дат

source: Note: After activating Polylang, settings will move to "Languages" menu
ru_ru: Примечание: После активации Polylang настройки переместятся в меню «Языки»

source: Log location:
ru_ru: Путь к логу:

source: Settings
ru_ru: Настройки

source: Warning:
ru_ru: Предупреждение:

source: Polylang plugin not detected. This plugin is designed to work with Polylang Automatic AI Translation.
ru_ru: Плагин Polylang не обнаружен. Этот плагин предназначен для работы с Polylang Automatic AI Translation.

source: Settings are located in the "Settings" section instead of Polylang menu.
ru_ru: Настройки находятся в разделе «Настройки», а не в меню Polylang.

source: Please select at least one post status.
ru_ru: Пожалуйста, выберите хотя бы один статус записи.

source: Untranslated Posts Only
ru_ru: Только непереведённые записи

source: Only untranslated posts
ru_ru: Только непереведённые записи

source: If checked, only posts that have not been translated will be processed.
ru_ru: Если отмечено, будут обрабатываться только записи, которые ещё не были переведены.

source: Untranslated only:
ru_ru: Только непереведённые:

source: Yes
ru_ru: Да

source: No
ru_ru: Нет
